<?
//~~~~~~~~~~~~~~~~~~Main Index Page~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
$MAIN[items]=array("ניהול מוצרים","ניהול קטגוריות","הוספת פריט חדש","עריכת פריט קיים","סטטיסטיקת מוצרים");
$MAIN[orders]=array("ניהול הזמנות","הזמנות ממתינות");
$MAIN[customers]=array("לקוחות","חיפוש לקוחות","פתיחת לקוח חדש","סטטיסטיקת לקוחות","הפצת הודעות מייל ללקוחות");
$MAIN[config]=array("הגדרות כלליות","הגדרת מטבע","תצוגת פריטים","הגדרת סגנון תצוגה","הגדרות כלליות","ניהול משלוחים");
$MAIN[content]=array("ניהול תוכן","עריכת תוכן קיים","הוספת דף חדש","עריכת חדשות","קבע כעמוד הבית");
$MAIN[database]=array("ניהול נתונים","יצוא מוצרים","יצוא הזמנות","יצוא רשימת לקוחות","יצוא קטגוריות");
$MAIN[general]=array("חפוש מהיר","חפוש","חפוש עלפי","הצג","שמור פרטים","הוספת קטגוריה","מחיקת קטגוריה","שינוי שם קטגוריה","תצוגה מקדימה");
$MAIN[header]=array("תפריט ראשי","שינוי סיסמה","הוספת מנהל חדש","תצוגה מקדימה","יציאה","מחובר","ברוך הבא לניהול ","לוח בקרה");
$MAIN[login]=array("כתובת אימייל","הקלד סיסמה","Ok","שם משתמש או סיסמה שגויים נסו שוב");
$MAIN[EmailSending]=array("שליחת הודעות לחברים באתר","קבוצה","אל","נושא","תוכן","שלח כעת");
//~~~~~~~~~~~~~~~~~~~~~~//~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~

//~~~~~~~~~~~~~~~~~~~~~~Items Page~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
$ITEM_LABEL=array("מקט","שם הפריט","מחיר ".$SITE[ItemsCurrency],"מחיר סופי","אחוז רוח לפריט","תמונה","כמות","מבצע","מיקום המוצר<br><small>מספר מספר בין 1-100","מספר חשיפות למוצר");
$ITEMS_ADD_LABEL=array("קטגוריה","תאור פריט");
$ITEMS_COLORS_LABEL=array("צבעים קיימים למוצר זה","שם צבע","למחיקת צבע לפריט לחצו על קוביית הצבע","לחץ לבחירת צבע");
//~~~~~~~~~~~~~~~~~~~~~~//~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~

//~~~~~~~~~~~~~~~~~~~~~~Pages Admin Page~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
$PAGES_CONTENT_LABEL=array("מס שורה","עדיפות תצוגה","כותרת דף","הצג בתפריט","עדכון אחרון");
//~~~~~~~~~~~~~~~~~~~~~~//~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~

//~~~~~~~~~~~~~~~~~~~~~~Pages list Page~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
$PAGES_LABEL=array("חיפוש עלפי כותרת","הצג","מוסתר");
//~~~~~~~~~~~~~~~~~~~~~~//~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~

//~~~~~~~~~~~~~~~~~~~~~~Categories Page~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
$CAT_LABEL=array("שם קטגוריה","הוספת מסנן","קטגורית אב","שינוי שם קטגוריה","לשנות ל-","שינוי מסנן ל-","מחיקת קטגוריה קימת","<קטגוריה ראשית>");

//~~~~~~~~~~~~~~~~~~~~~~//~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~

//~~~~~~~~~~~~~~~~~~~~~~Orders Page~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
$ORDER_LABEL=array("הצג הזמנות במצב:","הצג את כל ההזמנות","חיפוש על פי:","מס הזמנה","שם לקוח");
$ORDERS_LIST_LABEL=array("מס הזמנה","שם לקוח","סכום סופי","תאריך הזמנה","מצב");
$DEATAILS_LABEL=array("מספר הזמנה.","שם לקוח","כתובת","כתובת למשלוח","סוג משלוח","עקוב אחר הזמנה","סוג כרטיס","מספר כרטיס אשראי","תאריך תפוגה","שם מלא","פריטים שהוזמנו","כמות","מחיר","משלוח","סה''כ להזמנה ","שינוי סטאטוס הזמנה","שמור שינויים","הערות","ת.ז","טלפון","כתובת דוא'ל");
//~~~~~~~~~~~~~~~~~~~~~~//~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~

//~~~~~~~~~~~~~~~~~~~~~~Rates Config Page~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
$RATES_LABEL=array("הצג מחירים במטבע","שער מטבע","הצגת מחיר ליד מוצר","אחוז רוח כללי נוסף","אחוז מע''מ","הזן מחירי פריטים ב - ");
//~~~~~~~~~~~~~~~~~~~~~~//~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~

//~~~~~~~~~~~~~~~~~~~~~~Procuct View Config Page~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
$PRODS_LABEL=array("מס פריטים לדף","סוג תצוגה","מידת תמונה קטנה","מידת תמונה בינונית","מידת תמונה גדולה","מסגרת תמונה","צבע מסגרת","רוחב","גובהה");
//~~~~~~~~~~~~~~~~~~~~~~//~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~

//~~~~~~~~~~~~~~~~~~~~~~Store Design  Config Page~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
$STYLE_LABEL=array("מיקום האתר בדף","רוחב האתר","רוחב חלק ימני/שמאלי","שוליים עליונים","שוליים שמאליים","רוחב תפריט צדדי","מיקום מבזקים","תצוגת קטגוריות","צבע רקע לאתר","צבע טקסט לתפריט נבחר","צבע טקסט לתפריט עליון","צבע רקע לתפריט עליון","תמונת רקע לאתר","צבע רקע לחלק עליון","צבע רקע לאזור אמצעי","צבע רקע לאזור התוכן","צבע רקע לפוטר","צבע טקסט לכותרות","צבע טקסט לסלוגן עליון","צבע טקסט לתפריט ימני","פינות מעוגלות","צבע טקסט כללי","גודל פונט לתוכן");
//~~~~~~~~~~~~~~~~~~~~~~//~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~

//~~~~~~~~~~~~~~~~~~~~~~Store General Config Page~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
$GENERAL_STORE_LABEL=array("שם אתר","כותרת אתר","יוצר האתר","כתובת האתר","כתובת מאובטחת","דואר אלקטרוני של מנהל האתר","מילים לקידום","תיאור קצר");
//~~~~~~~~~~~~~~~~~~~~~~//~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~

//~~~~~~~~~~~~~~~~~~~~~~Messages and Alerts~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
$MSGS=array("בבקשה רשום שם קטגוריה חוקי","כתובת דואר או סיסמה לא נכונים","הינך מוסיף קטגוקיה ראשית !","אין באפשרותך למחוק קטגוריה ראשית !","פעולה","האם אתה בטוח שאתה מעוניין למחוק?","אין הזמנות במערכת","הפריט קיים במערכת ויוחלף!","תמונת פריט נמחקה מהמערכת");
//~~~~~~~~~~~~~~~~~~~~~~//~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~

//~~~~~~~~~~~~~~~~~~~~~~SPECIAL OFFER/ ITEMS ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
$ITEMS_OFFER=array("מכירה כללית","במכירה","הצעה מיוחדת");
//~~~~~~~~~~~~~~~~~~~~~~//~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~

//~~~~~~~~~~~~~~~~~~~~~~Items Search Page~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
$ITEM_SEARCH_LABEL=array("חיפוש מוצרים","השתמש ב שםפריט/תאור/מקט","הצג את כל המוצרים");
$ITEM_TABLE_LABEL=array("קטגוריה","עריכה","מחיקת פריט","מספר חשיפות");
//~~~~~~~~~~~~~~~~~~~~~~//~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~

//~~~~~~~~~~~~~~~~~~~~~~Customers Search Page~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
$CUSTOMERS_LABEL=array("לקוח רשום","חיפוש לקוח","רשום שם לקוח","לחץ לרשימת לקוחות מלאה");
$CUSTOMERS_LIST_LABEL=array("מס לקוח","דואר אלקטרוני","שם פרטי","שם משפחה","ת.ז.");
//~~~~~~~~~~~~~~~~~~~~~~//~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~

//~~~~~~~~~~~~~~~~~~~~General Options~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
$YES_NO_LABEL=array(1=>"כן",0=>"לא");
$SHOW_OPTIONS=array(1=>"הצג",0=>"מוסתר");
//~~~~~~~~~~~~~~~~~~~~//~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~

//~~~~~~~~~~~~~~~~~~~~CONTENT EDIT PAGE~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
$CONTENT_LABEL=array("בחר דף קיים או צור או צור דף חדש","כותרת דף(מוצג בתפריט)","הצג בתפריט","מיקום בתפריט","קישור חיצוני","תחולת דף","דף חדש");
$CONTENT_TREE_LABEL=array("עמוד אב","בחר עמוד אב","עמוד בתפריט עליון");
$CONTENT_SUBS_LABEL=array("צבע רקע תת תפריט","צבע רקע במעבר עכבר","צבע טקסט בתפריט");
//~~~~~~~~~~~~~~~~~~~~//~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~

//~~~~~~~~~~~~~~~~~~~~STORE STYLE STYLE PAGE~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
$PROD_SHOW_OPTIONS=array(1=>"רשימה",0=>"גלריה");
$STYLE_ALIGN_OPTIONS=array("center"=>"מרכז","right"=>"ימין","left"=>"שמאל");
$STYLE_NEWS_OPTIONS=array("right"=>"ימין","left"=>"שמאל");
$STYLE_MENU_OPTIONS=array(1=>"תפריט רגיל",0=>"תפריט קופץ");
$RATES_TYPE_OPTIONS=array("₪"=>"שח","$"=>"דולר");
$RATES_CURRENCY_OPTIONS=array(1=>"תפריט רגיל",0=>"תפריט קופץ");
//~~~~~~~~~~~~~~~~~~~~//~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
$LABEL[login]=array("כתובת דוא''ל","סיסמה","כניסה","פתיחת חשבון","שכחתי סיסמה");
?>